import Svg,{Path,Text,TSpan} from 'react-native-svg';

export default function () {
    return (
        <Svg
            viewBox="19.8296 12.7162 33.3414 12.8528"
            width="33.3414mm"
            height="12.8528mm"
        >
            <Path
                d="M -234.63 -231.43 L -261.96 -231.43 C -264.11 -231.43 -265.87 -230.21 -265.87 -228.72 L -265.87 -220.59 C -265.87 -219.1 -264.11 -217.88 -261.96 -217.88 L -234.63 -217.88 C -232.47 -217.88 -230.72 -219.1 -230.72 -220.59 L -230.72 -228.72 C -230.72 -230.21 -232.47 -231.43 -234.63 -231.43 Z M -232.66 -221.94 C -232.66 -221.13 -233.46 -220.59 -234.63 -220.59 L -261.96 -220.59 C -263.13 -220.59 -263.92 -221.13 -263.92 -221.94 L -263.92 -228.72 C -263.92 -229.53 -263.13 -230.08 -261.96 -230.08 L -234.63 -230.08 C -233.46 -230.08 -232.66 -229.53 -232.66 -228.72 L -232.66 -221.94 Z"
                fill="#f6d33c"
                fillOpacity="1"
                strokeWidth="1.627"
                strokeDasharray="none"
                transform="matrix(0.9485457492002068, 0, 0, 0.9485457492002068, 272.01944303940724, 232.23813963152278)"
            />
            <Text
                fontStyle="normal"
                fontWeight="bold"
                fontSize={13}
                fontFamily="Lalezar"
                fill="#f6d33c"
                fillOpacity="1"
                stroke="none"
                strokeWidth="6.14929"
                strokeDasharray="none"
                strokeOpacity="1"
                x={571.757}
                y={496.254}
                transform="matrix(0.9485457492002068, 0, 0, 0.9485457492002068, 272.01944303940724, 232.23813963152278)"
            >
                <TSpan x="-261.94" y="-223.32" fontSize={6}>
                    لینک محصول
                </TSpan>
            </Text>
        </Svg>
    );

}